//==============================================================================
// Main
//==============================================================================

#include <QApplication>
#include <QPointer>

//==============================================================================

#include "mainwindow.h"

//==============================================================================



int main(int pArgc, char *pArgv[])
{
    int res;

    QPointer<QApplication> app;
    QPointer<MainWindow> win;

    // Создание приложения

    app = new QApplication(pArgc, pArgv);

    // Создание main window

    win = new MainWindow;

    // Отображение main window

    win->show();

    // Выполнение приложения

    res = app->exec();

    // Удаление main window

    delete win;

    // Удаление приложения

    delete app;

    // Конец ...

    return res;
}

//==============================================================================
// End of file
//==============================================================================

